Revit 2026 API

# EnergyAnalysisOpeningType Enumeration

---

Energy analysis opening type.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum EnergyAnalysisOpeningType
```
```vb
Public Enumeration EnergyAnalysisOpeningType
```
```cpp
public enum class EnergyAnalysisOpeningType
```
```fsharp
type EnergyAnalysisOpeningType
```

| Member name | Value | Description |
| --- | --- | --- |
| Air | 3 | Air. |
| Door | 0 | Door. |
| Skylight | 2 | Skylight. |
| Window | 1 | Window. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace